import 'package:flutter/material.dart';

class PolicyController extends ChangeNotifier {
  static final PolicyController _instance = PolicyController._internal();
  factory PolicyController() => _instance;
  PolicyController._internal() {
    print('Initializing: PolicyController');
  }

  final String privacyPolicy = """
  سياسة الخصوصية وشروط الاستخدام تطبيق Ayam Chat

تاريخ التحديث: 1 يونيو 2024

1. مقدمة
نحن في Ayam Chat نلتزم بحماية خصوصيتك وبياناتك الشخصية. توضح هذه السياسة كيفية جمع واستخدام وحماية معلوماتك عند استخدام تطبيقنا.

2. المعلومات التي نجمعها
• معلومات الملف الشخصي: مثل الاسم، الصورة، وتاريخ الميلاد.
• معلومات الجهاز: نوع الجهاز، ونظام التشغيل.
• المحتوى: الرسائل والاتصالات الصوتية داخل الغرف.

3. كيف نستخدم معلوماتك
• لتحسين تجربة المستخدم وتقديم خدمات مخصصة.
• لإدارة غرف الدردشة والفعاليات.
• لضمان أمان التطبيق ومنع الانتهاكات.

4. مشاركة البيانات
نحن لا نبيع بياناتك الشخصية لأي طرف ثالث. قد نشارك المعلومات فقط في حالات الامتثال للقوانين أو لحماية حقوق المستخدمين.

5. الأمان
نتخذ تدابير تقنية وإدارية متقدمة لحماية بياناتك من الوصول غير المصرح به.

6. حقوق المستخدم
لديك الحق في الوصول إلى بياناتك أو تعديلها أو طلب حذف حسابك في أي وقت من خلال إعدادات التطبيق.

7. التعديلات على السياسة
قد نقوم بتحديث هذه السياسة من وقت لآخر، وسيتم إخطار المستخدمين بأي تغييرات جوهرية.

8. اتصل بنا
إذا كان لديك أي استفسار حول سياسة الخصوصية، يرجى التواصل مع الدعم الفني.
  """;

  final String termsOfService = """
  شروط الاستخدام

1. السلوك العام
يجب على جميع المستخدمين احترام الآخرين والالتزام بآداب الحوار. يمنع منعا باتاً استخدام لغة مسيئة أو عنصرية.

2. المحتوى المحظور
يمنع نشر أي محتوى إباحي، سياسي متطرف، أو يحرض على العنف والكراهية.

3. الحسابات
أنت مسؤول عن الحفاظ على سرية معلومات حسابك وأي نشاط يحدث من خلاله.

4. العقوبات
نحتفظ بالحق في تجميد أو حظر أي حساب ينتهك شروط الاستخدام دون إشعار مسبق.
  """;
}
